import classes from "./faqContainer.module.css";
import FaqItem from "./faq";
import { useState } from "react";

const DUMMY_DATA = [
  {
    id: "q1",
    question: "آزمایشگاه نوین در کجا قرار دارد ؟",
    answer:
      "پاکدشت،خیابان شهید مطهری،نرسیده به میدان آزادگان (شعبه)،کوچه صاحب الزمان،پلاک ۵",
    active: true,
  },
  {
    id: "q2",
    question:
      "چگونه می توانیم از خدمات مشاوره رایگان جهت انجام تست های آزمایشگاه بهرمند شویم ؟",
    answer:
      "شما می توانید با تلفن های آزمایشگاه تماس گرفته یا به شماره ی ۰۹۰۲۱۳۲۵۴۷۲ در پیام رسان واتساپ پیام دهید.",
    active: false,
  },
  {
    id: "q3",
    question: "پذیرش مراجعه کنندگان آزمایشگاه چه ساعتی ضورت می گیرد ؟",
    answer: "ساعت کاری ۶:۳۰ صبح  تا ۸ شب می باشد",
    active: false,
  },
  {
    id: "q4",
    question:
      "آیا در آزمایشگاه نوین امکان دریافت جواب آزمایشات به صورت غیر حضوری وجود دارد ؟",
    answer:
      "بله در سایت آزمایشگاه نوین جواب دهی آنلاین آزمایشگاه برروی گزینه جواب دهی بیمار کلیک کنید و با ثبت شماره موبایل ، کد ملی و شماره قبض خود از جواب آزمایش خود به صورت غیر حضوری مطلع شوید.",
    active: false,
  },
  {
    id: "q5",
    question: "هزینه های آزمایشگاه نوین چگونه است ؟",
    answer:
      "هزینه های آزمایش طبق تعرفه دولت و طرف قرارداد کلیه بیمه ها بیمه های تکمیلی می باشد و هیچ گونه هزینه اضافی از بیمار دریافت نمی شود.",
    active: false,
  },
  {
    id: "q6",
    question: "مدارک مورد نیاز برای مراجعه به آزمایشگاه چیست ؟",
    answer:
      "در زمان مراجعه به آزمایشگاه نوین همراه داشتن کارت ملی و کدرهگیری آزمایش الزامی است.",
    active: false,
  },
  {
    id: "q7",
    question: "از چه طریق می توان در آزمایشگاه نوبت گرفت ؟",
    answer:
      "برای نوبت گیری می توان روز قبل حضوری در نوبت  عصر پذیرش شد و روزبعد ناشتا نمونه گیری انجام داد و برای نوبت گیری اینترنتی  از آزمایشگاه نوین در  سایت برروی گزینه نوبت دهی  کلیک کرده و نوبت خود را انتخاب و ثبت کنید",
    active: false,
  },
  {
    id: "q8",
    question:
      "آیا امکان انجام تمامی تست های آزمایشگاه در آزمایشگاه پاتوبیولوژی نوین وجود دارد ؟",
    answer:
      "بله با توجه به وجود سبد آزمایش های ارسالی و داخلی آزمایشگاه نوین ، امکان  انجام اکسر تست ها وجود دارد.",
    active: false,
  },
  {
    id: "q9",
    question:
      "بله با توجه به وجود سبد آزمایش های ارسالی و داخلی آزمایشگاه نوین ، امکان  انجام اکسر تست ها وجود دارد.",
    answer:
      "بله آزمایشگاه همکار ما به نام آزمایشگاه میلاد تست های ژنتیک شما را انجام می دهد اگر مایلید تست ژنتیک انجام دهید.",
    active: false,
    link: "https://miladlab.com",
  },
  {
    id: "q10",
    question: "آیا آزمایشگاه نوین تست PCR انجام می دهد ؟",
    answer:
      "بله آزمایشگاه همکار ما به نام آزمایشگاه میلاد تست PCR شما را انجام می دهد اگر مایلید تست PCR انجام دهید ",
    active: false,
    link: "https://miladlab.com",
  },
];

const FAQS = () => {
  const [callMe, setCallMe] = useState(false);
  const activeMe = (id) => {
    DUMMY_DATA.forEach((item) => {
      if (item.id === id) {
        // debugger;
        item.active = true;
        setCallMe(!callMe);
        return;
      }
      item.active = false;
    });
  };

  return (
    <div className={classes.Container}>
      <div className={classes.faqContainer}>
        {DUMMY_DATA.map((q) => {
          return <FaqItem key={q.id} faq={q} onActive={activeMe} />;
        })}
      </div>
    </div>
  );
};
export default FAQS;
